samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
// Timing 
#define SEMPAHORE_DELAY_1 5000   // (ms) 

//==================================================

//==================================================
// Software Timer Test 0 

// There are two software timers, one is a one-shot and the other is a repeat. Both 
// timers have the same callback function that will display which timer has expired 
// in the serial terminal. 

// Timing 
#define SOFTWARE_TIMER_0_DELAY_1 1000    // ms 
#define SOFTWARE_TIMER_0_PERIOD_1 1000   // Ticks 
#define SOFTWARE_TIMER_0_PERIOD_2 2000   // Ticks 

//==================================================

//==================================================
// Software Timer Test 1 

// Use the board LED to simulate a backlight display. When characters are entered in 
// the serial terminal (doesn't matter what), the LED lights up as if we're interfacing 
// with a screen menu. Turn the LED off after 5 second of no input (inactivity). Use a 
// software timer to accomplish this. Hint: xTimerStart will restart a counter if it's 
// called before the timer expires. 

// Memory 
#define SOFTWARE_TIMER_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

// Timing 
#define SOFTWARE_TIMER_1_DELAY_1 1000   // ms 
#define SOFTWARE_TIMER_1_DELAY_2 5      // ms
#define SOFTWARE_TIMER_1_PERIOD 5000    // ticks 

//==================================================

//==================================================
// Hardware Interrupts Test 

// Use a hardware timer (ISR) to sample an ADC 10 times per second (10 Hz) and store the 
// values in a double or circular buffer. A double or circular buffer is recommended so 
// data can be read/used at the same time new data gets written. Once 10 samples have 
// been collected, the ISR should wake up task A which computes the average of the 10 
// samples and stores the result in a global floating point variable. Assume this global 
// variable cannot be written to or read from in a single instruction cycle (critical 
// section). Task B will output the value of the global variable to the serial terminal 
// if "avg" is entered by the user, otherwise the input is ignored. 

// Memory 
#define HARDWARE_INT_STACK_SIZE configMINIMAL_STACK_SIZE * 4 

//==================================================

//==================================================
// Deadlock and Starvation Test 

// 

//==================================================

//==================================================
// Priority Inversion Test 

// 

//==================================================

//=======================================================================================


//=======================================================================================
// Variables 

// Task definition: main loop 
osThreadId_t mainLoopHandle; 
const osThreadAttr_t main_loop_attributes = 
{
    .name = "main_loop", 
    .stack_size = MAIN_LOOP_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityLow   // Above Idle but below everything else 
}; 

// Serial terminal data 
static uint8_t uart_dma_buff[SERIAL_INPUT_MAX_LEN];   // Circular buffer 
static uint8_t buff_index;                            // Circular buffer index 
static uint8_t user_in_buff[SERIAL_INPUT_MAX_LEN];    // Stores latest user input 

#if PERIODIC_BLINK_TEST 

// Task definition: blink01 
osThreadId_t blink01Handle; 
const osThreadAttr_t blink01_attributes = 
{
    .name = "blink01", 
    .stack_size = PB_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Task definition: blink02 
osThreadId_t blink02Handle; 
const osThreadAttr_t blink02_attributes = 
{
    .name = "blink02",
    .stack_size = PB_STACK_SIZE,
    .priority = (osPriority_t) osPriorityBelowNormal 
};

// Board LED state - tasks will fight over the LED state 
static gpio_pin_state_t led_state = GPIO_LOW; 

#elif MANUAL_BLINK_TEST 

// Task definition: MB01 
osThreadId_t MB01Handle; 
const osThreadAttr_t MB01_attributes = 
{
    .name = "MB01", 
    .stack_size = MB_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Board LED blink rate 
static uint32_t mb_ticks = MB_MIN_LED_RATE; 

#elif TASK_SCHEDULING_TEST 

// Task definition: msg01 
osThreadId_t msg01Handle = NULL; 
const osThreadAttr_t msg01_attributes = 
{
    .name = "msg01", 
    .stack_size = TS_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityBelowNormal 
};

// Task definition: msg02 
osThreadId_t msg02Handle = NULL; 
const osThreadAttr_t msg02_attributes = 
{
    .name = "msg02",
    .stack_size = TS_STACK_SIZE,
    .priority = (osPriority_t) osPriorityNormal 
};

// Strings 
const char msg[] = "Barkadeer brig Arr booty rum"; 

#elif MEMORY_MANAGEMENT_TEST 

// Task definition: MM01 
osThreadId_t MM01Handle; 
const osThreadAttr_t MM01_attributes = 
{
    .name = "MM01", 
    .stack_size = MM_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Pointer used to locate heap allocated memory 
static char *user_msg = NULL; 

#elif QUEUE_TEST 

// Task definition: queue01 
osThreadId_t queue01Handle; 
const osThreadAttr_t queue01_attributes = 
{
    .name = "queue01", 
    .stack_size = QUEUE_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Queue info 
static const uint8_t msg_queue_len = 5; 
static QueueHandle_t msg_queue_0; 
static QueueHandle_t msg_queue_1; 

#elif MUTEX_TEST 

// Task definition: increment01 
osThreadId_t increment01Handle; 
const osThreadAttr_t increment01_attributes = 
{
    .name = "increment01", 
    .stack_size = MUTEX_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Task definition: increment02 
osThreadId_t increment02Handle; 
const osThreadAttr_t increment02_attributes = 
{
    .name = "increment02",
    .stack_size = MUTEX_STACK_SIZE,
    .priority = (osPriority_t) osPriorityBelowNormal 
};

// Shared task counter 
static uint16_t counter_shared = CLEAR; 

// Mutex 
static SemaphoreHandle_t mutex; 

#elif SEMAPHORE_TEST 

// Task definition: increment01 
osThreadId_t semaphoreSetupHandle; 
const osThreadAttr_t semaphoreSetup_attributes = 
{
    .name = "semaphoreSetup", 
    .stack_size = SEMAPHORE_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Semaphores 
static SemaphoreHandle_t binary_sem;   // Allows for parameter copying 
static SemaphoreHandle_t filled_sem;   // Number of filled slots in the circular buffer 
static SemaphoreHandle_t empty_sem;    // Number of empty slots in the circular buffer 

// Mutex 
static SemaphoreHandle_t buff_mutex;   // Protects the circular buffer and serial output 

// Data 
static uint8_t buff[SEMAPHORE_BUFF_SIZE];  // Circular buffer 
static uint8_t write_index = CLEAR;        // Write/head index for circular buffer 
static uint8_t read_index = CLEAR;         // Read/tail index for circular buffer 

#elif SOFTWARE_TIMER_TEST_0 

// Timer(s) - FreeRTOS API method 
static TimerHandle_t one_shot_timer = NULL; 
static TimerHandle_t auto_reload_timer = NULL; 

