samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
// Timer(s) - CMSIS API method 
// static osTimerId_t oneShotTimerHandle; 
// const osTimerAttr_t oneShot_attributes = { .name = "oneShotTimer" }; 

#elif SOFTWARE_TIMER_TEST_1 


// Task definition: softwareTimer 
osThreadId_t softwareTimerHandle; 
const osThreadAttr_t softwareTimer_attributes = 
{
    .name = "softwareTimer",
    .stack_size = SOFTWARE_TIMER_STACK_SIZE,
    .priority = (osPriority_t) osPriorityNormal 
};

// Timer(s) 
static TimerHandle_t display_timer = NULL; 

#elif HARDWARE_INTERRUPT_TEST 

// Task definition: hardwareInterrupt01 
osThreadId_t hardwareInterrupt01Handle; 
const osThreadAttr_t hardwareInterrupt01_attributes = 
{
    .name = "hardwareInterrupt01", 
    .stack_size = HARDWARE_INT_STACK_SIZE, 
    .priority = (osPriority_t) osPriorityNormal 
};

// Data 
static double avg = CLEAR; 
static volatile uint16_t adc_result[2][10]; 
static uint8_t write_index = CLEAR; 
static uint8_t read_index = SET_BIT; 

// Semaphore(s) and Mutex 
static SemaphoreHandle_t binary_sem_0; 
static SemaphoreHandle_t binary_sem_1; 
static SemaphoreHandle_t mutex; 

#elif DEADLOCK_STARVATION_TEST 
#elif PRIORITY_INVERSION_TEST 

#endif 

//=======================================================================================


//=======================================================================================
// Prototypes 

/**
 * @brief Task function: main loop 
 * 
 * @param argument : NULL 
 */
void TaskLoop(void *argument); 

#if PERIODIC_BLINK_TEST 

/**
 * @brief Task function: blink01 
 * 
 * @param argument : NULL 
 */
void TaskBlink01(void *argument); 


/**
 * @brief Task function: blink02 
 * 
 * @param argument : NULL 
 */
void TaskBlink02(void *argument); 


/**
 * @brief LED toggle 
 * 
 * @param ticks : delay between LED toggling (ticks). See notes for info on ticks. 
 */
void blink_led_toggle(uint32_t ticks); 

#elif MANUAL_BLINK_TEST 

/**
 * @brief Task function: MB01 
 * 
 * @param argument : NULL 
 */
void TaskMB01(void *argument); 

#elif TASK_SCHEDULING_TEST 

/**
 * @brief Task function: msg01 
 * 
 * @param argument : NULL 
 */
void TaskMsg01(void *argument); 


/**
 * @brief Task function: msg02 
 * 
 * @param argument : NULL 
 */
void TaskMsg02(void *argument); 

#elif MEMORY_MANAGEMENT_TEST 

/**
 * @brief Task function: MM01 
 * 
 * @param argument : NULL 
 */
void TaskMM01(void *argument); 

#elif QUEUE_TEST 

/**
 * @brief Task function: queue01 
 * 
 * @param argument : NULL 
 */
void TaskQueue01(void *argument); 

#elif MUTEX_TEST 

/**
 * @brief Task function: increment01 
 * 
 * @param argument : NULL 
 */
void TaskInc01(void *argument); 


/**
 * @brief Task function: increment02 
 * 
 * @param argument : NULL 
 */
void TaskInc02(void *argument); 


/**
 * @brief Increment counter 
 * 
 * @param delay : task delay time (ticks) 
 */
void increment_counter(uint16_t delay); 

#elif SEMAPHORE_TEST 

/**
 * @brief Task function: semaphoreSetup 
 * 
 * @param argument : NULL 
 */
void TaskSemaphoreSetup(void *argument); 


/**
 * @brief Task function: semaphoreProducer 
 * 
 * @param argument : NULL 
 */
void TaskSemaphoreProducer(void *argument); 


/**
 * @brief Task function: semaphoreConsumer 
 * 
 * @param argument : NULL 
 */
void TaskSemaphoreConsumer(void *argument); 

#elif SOFTWARE_TIMER_TEST_0 

/**
 * @brief Called when one of the timers expires 
 * 
 * @param xTimer : software timer ID 
 */
void myTimerCallback(TimerHandle_t xTimer); 

#elif SOFTWARE_TIMER_TEST_1 

/**
 * @brief Task function: softwareTimer 
 * 
 * @param argument : NULL 
 */
void TaskSoftwareTimer(void *argument); 


/**
 * @brief Called when the display sees no activity 
 * 
 * @param argument : NULL 
 */
void DisplayBacklightCallback(TimerHandle_t argument); 

#elif HARDWARE_INTERRUPT_TEST 

/**
 * @brief Task function: hardwareInterrupt 
 * 
 * @param argument : NULL 
 */
void TaskHardwareInterrupt(void *argument); 

#elif DEADLOCK_STARVATION_TEST 
#elif PRIORITY_INVERSION_TEST 

#endif

//=======================================================================================


//=======================================================================================
// Setup code

void freertos_test_init(void)
{
    //==================================================
    // General setup 

    // Initialize GPIO ports 
    gpio_port_init(); 

    // General purpose timer 
    tim_9_to_11_counter_init(
        TIM9, 
        TIM_84MHZ_1US_PSC, 
        0xFFFF,  // Max ARR value 
        TIM_UP_INT_DISABLE); 
    tim_enable(TIM9); 

    // Initialize board LED (on when logic low) 
    gpio_pin_init(GPIOA, PIN_5, MODER_GPO, OTYPER_PP, OSPEEDR_HIGH, PUPDR_NO); 

    // Initialize UART 
    uart_init(
        USART2, 
        GPIOA, 
        PIN_3, 
        PIN_2, 
        UART_FRAC_42_9600, 
        UART_MANT_42_9600, 
        UART_DMA_DISABLE, 
        UART_DMA_ENABLE);   // RX DMA enabled for serial terminal reading 
    
    // Enable IDLE line interrupts for reading serial terminal input with DMA 
    uart_interrupt_init(
        USART2, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_ENABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE); 

    // Initialize the DMA stream 
    dma_stream_init(
        DMA1, 
        DMA1_Stream5, 
        DMA_CHNL_4, 
        DMA_DIR_PM, 
        DMA_CM_ENABLE,
        DMA_PRIOR_VHI, 
        DMA_ADDR_INCREMENT,   // Increment the buffer pointer to fill the buffer 
        DMA_ADDR_FIXED,       // No peripheral increment - copy from DR only 
        DMA_DATA_SIZE_BYTE, 
        DMA_DATA_SIZE_BYTE); 

    // Configure and enable the DMA stream 
    dma_stream_config(
        DMA1_Stream5, 
        (uint32_t)(&USART2->DR), 
        (uint32_t)uart_dma_buff, 
        (uint16_t)SERIAL_INPUT_MAX_LEN); 
    dma_stream_enable(DMA1_Stream5); 

    // Initialize interrupt handler flags and enable the interrupt handler 
    int_handler_init(); 
    nvic_config(USART2_IRQn, EXTI_PRIORITY_0); 

    // Initialize FreeRTOS scheduler 
    osKernelInitialize(); 

