samdonnelly/STM32F4-driver-test/sources/app_test/freertos_test.c
    xSemaphoreGive(binary_sem_1); 

    uart_sendstring(USART2, ">>> "); 

#elif DEADLOCK_STARVATION_TEST 
#elif PRIORITY_INVERSION_TEST 
    
#endif
} 

//=======================================================================================


//=======================================================================================
// Test code 

void freertos_test_app(void)
{
    // Start scheduler. From this point on, execution is handled by the scheduler and 
    // only code within the tasks is run, meaning the code does not pass through the main 
    // while(1) loop anymore. 
    osKernelStart(); 
}


// Task function: main loop 
void TaskLoop(void *argument)
{
    while (1)
    {
#if PERIODIC_BLINK_TEST 
        // Do nothing 
#elif MANUAL_BLINK_TEST 

        // This interrupt flag will be set when an idle line is detected on UART RX after 
        // receiving new data. 
        if (handler_flags.usart2_flag)
        {
            handler_flags.usart2_flag = CLEAR; 

            // Get the user input and update the LED blink rate 
            cb_parse(uart_dma_buff, user_in_buff, &buff_index, SERIAL_INPUT_MAX_LEN); 
            mb_ticks = (uint32_t)strtol((char *)user_in_buff, NULL, 10); 

            // Make sure rate can't go below a certain threshold to prevent this task 
            // from never running. 
            if (mb_ticks < MB_MIN_LED_RATE)
            {
                mb_ticks = MB_MIN_LED_RATE; 
            }

            uart_sendstring(USART2, "\r\n>>> "); 
        }
        
#elif TASK_SCHEDULING_TEST 

        // Suspend the higher priority task for some intervals 
        for (uint8_t i = CLEAR; i < 3; i++)
        {
            osThreadSuspend(msg02Handle); 
            osDelay(TS_DELAY_1); 
            osThreadResume(msg02Handle); 
            osDelay(TS_DELAY_1); 
        }
        
        // Delete the lower priority task 
        if (msg01Handle != NULL)
        {
            osThreadTerminate(msg01Handle); 
            msg01Handle = NULL; 
        }

#elif MEMORY_MANAGEMENT_TEST 

        // This interrupt flag will be set when an idle line is detected on UART RX after 
        // receiving new data. 
        if (handler_flags.usart2_flag)
        {
            handler_flags.usart2_flag = CLEAR; 

            uint8_t user_in_buff_local[SERIAL_INPUT_MAX_LEN]; 
            uint32_t input_len; 
            uint8_t mem_info[MM_STR_MAX_LEN]; 

            // Get the user input from the circular buffer 
            cb_parse(uart_dma_buff, user_in_buff_local, &buff_index, SERIAL_INPUT_MAX_LEN); 

            snprintf(
                (char *)mem_info, 
                MM_STR_MAX_LEN, 
                "Free task stack (words): %lu\r\nFree heap before malloc (bytes): %lu\r\n", 
                (uint32_t)uxTaskGetStackHighWaterMark(NULL), 
                (uint32_t)xPortGetFreeHeapSize()); 
            uart_sendstring(USART2, (char *)mem_info); 

            // Store the input in heap memory. 'input_len' is made one longer than strlen 
            // provides so that the null termination of 'user_in_buff_local' will be 
            // copied to the heap and print properly to the serial terminal. 
            input_len = (uint32_t)strlen((char *)user_in_buff_local) + 1; 
            user_msg = (char *)pvPortMalloc(input_len); 

            if (user_msg != NULL)
            {
                memcpy((void *)user_msg, (void *)user_in_buff_local, input_len); 
            }

            snprintf(
                (char *)mem_info, 
                MM_STR_MAX_LEN, 
                "Free heap after malloc (bytes): %lu\r\n", 
                (uint32_t)xPortGetFreeHeapSize()); 
            uart_sendstring(USART2, (char *)mem_info); 

            osThreadResume(MM01Handle); 
        }

#elif QUEUE_TEST 

        static uint32_t blink_count = CLEAR; 

        // This interrupt flag will be set when an idle line is detected on UART RX after 
        // receiving new data. 
        if (handler_flags.usart2_flag)
        {
            handler_flags.usart2_flag = CLEAR; 

            // Get the user input from the circular buffer 
            cb_parse(uart_dma_buff, user_in_buff, &buff_index, SERIAL_INPUT_MAX_LEN); 
            
            // Check for a valid delay command. If found then updated the LED delay rate. 
            if (str_compare("delay ", (char *)user_in_buff, BYTE_0))
            {
                char *delay_value_cmd = (char *)(user_in_buff + BYTE_6); 
                uint32_t delay_value = (uint32_t)strtol(delay_value_cmd, NULL, 10); 

                if (delay_value != 0)
                {
                    if (delay_value < QUEUE_MIN_LED_RATE)
                    {
                        delay_value = QUEUE_MIN_LED_RATE; 
                    }

                    // Send delay value to queue 0 
                    if (xQueueSend(msg_queue_0, (void *)&delay_value, 0) == pdTRUE)
                    {
                        char delay_value_str[SERIAL_INPUT_MAX_LEN]; 
                        snprintf(
                            delay_value_str, 
                            SERIAL_INPUT_MAX_LEN, 
                            "Blink delay (ms): %lu", 
                            delay_value); 
                        uart_sendstring(USART2, delay_value_str); 
                        uart_send_new_line(USART2); 
                    }
                    else 
                    {
                        uart_sendstring(USART2, "Queue full.\n"); 
                    }

                }
            }

            uart_sendstring(USART2, "\r\n>>> "); 
        }

        // Print new messages from queue 1 
        if (xQueueReceive(msg_queue_1, (void *)&blink_count, 0) == pdTRUE)
        {
            char blink_count_str[SERIAL_INPUT_MAX_LEN]; 
            snprintf(
                blink_count_str, 
                SERIAL_INPUT_MAX_LEN, 
                "\rBlink count (x100): %lu\n", 
                blink_count); 
            uart_sendstring(USART2, blink_count_str); 
            uart_sendstring(USART2, "\r\n>>> "); 
        }

